[
    {
        "title": "1945-2015 Rebuilding Dresden",
        "source": "https://mashable.com/feature/rebuilding-dresden",
        "key_text": "Over two days and nights in February 1945, American and British bombers dropped 2,400 tons of high explosives and 1,500 tons of incendiary bombs on the German city of Dresden.",
        "why_interesting": "Two days to bomb, decades to rebuild.",
        "screenshot": "sheep-frauenkirche-dresden-1957.jpg"
    },
    {
        "title": "1968 Has Ended",
        "source": "https://charlesschifano.substack.com/p/1968-has-ended",
        "key_text": "The ’68 shackles, so ubiquitous in politics and culture, are now gone. Although it didn’t happen because of the usual reasons. New generations didn’t rise up and rebel. Nobody was tossed off the boat. Nobody was forced to resign. What happened, instead, was more prosaic, and certainly more subtle, but I’ve noticed it a few times recently, especially since the beginning of the pandemic—it comes in casual conversations with university students or with those just entering their twenties, and it should have been predictable. For the first time, the period is simply too far away. If you’re an undergraduate now, you were probably born after another milestone, September 2001, and that makes 1968, for the most part, as distant as the French Revolution.",
        "why_interesting": "Culture is moving on rapidly these days.",
        "screenshot": "a-space-odyssey-1968.jpg"
    },
    {
        "title": "20 Years After The End Of The World",
        "source": "https://www.npr.org/2021/12/09/1062519603/radiohead-kid-a-amnesiac-throughline-thom-yorke-stanley-donwood",
        "key_text": "Around the same time, a Polish philosopher named Zygmunt Bauman published a book called Liquid Modernity. His big idea was that the anxiety and unease people in the West were feeling in the late 20th century was due to the fact that technology was developing faster than culture: We could not keep up with the lightning-fast advancements in communication, transportation and entertainment.",
        "why_interesting": "",
        "screenshot": "kid-a.jpg"
    },
    {
        "title": "Effective learning: Twenty rules of formulating knowledge",
        "source": "https://www.supermemo.com/en/blog/twenty-rules-of-formulating-knowledge",
        "key_text": "The speed of learning will depend on the way you formulate the material. The same material can be learned many times faster if well formulated! The difference in speed can be stunning!  ",
        "why_interesting": "Learning how to learn is an important skill never taught.",
        "screenshot": "why-we-stopped-making-einsteins.webp"
    },
    {
        "title": "4 Principles for Chess Improvement",
        "source": "https://zwischenzug.substack.com/p/4-principles-for-chess-improvement",
        "key_text": "There are more resources out there than ever. On the one hand, this is great: you have lots of material to work with. On the other, it’s a nightmare: there seems to be a huge mountain of stuff to get through. The good news is, you really don’t have to do most of that stuff. The bad news – well, it’s not really bad news – is you need to focus relentlessly on what actually matters.",
        "why_interesting": "Keep your chess training simple but consistent if you want results.",
        "screenshot": "lichess-horsey.png"
    },
    {
        "title": "A Coder Considers the Waning Days of the Craft",
        "source": "https://archive.ph/6VSg5",
        "key_text": "So maybe the thing to teach isn’t a skill but a spirit. I sometimes think of what I might have been doing had I been born in a different time. The coders of the agrarian days probably futzed with waterwheels and crop varietals; in the Newtonian era, they might have been obsessed with glass, and dyes, and timekeeping. I was reading an oral history of neural networks recently, and it struck me how many of the people interviewed—people born in and around the nineteen-thirties—had played with radios when they were little. Maybe the next cohort will spend their late nights in the guts of the A.I.s their parents once regarded as black boxes. I shouldn’t worry that the era of coding is winding down. Hacking is forever.",
        "why_interesting": "What you think has always been the way it is, might be a very recent development.",
        "screenshot": "lee-sedol.webp"
    },
    {
        "title": "A Guide to Russian Media in the Times of Total Censorship",
        "source": "https://www.proekt.media/en/guide-en/russian-media-after-war-en",
        "key_text": "The advertising model is practically disabled -- the largest international advertisers have left the market, while domestic advertisers have no desire to work with the outlawed media. As a result, the non-profit model has proven to be the most desirable, and demand for institutional donor grants has grown exponentially.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Achieving GM Level Strength Without Calculation",
        "source": "https://www.chess-journal.com/googleSearchless.html",
        "key_text": "It's possible to create an engine without a search that reaches grandmaster strength.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "A Personal Computer for Children of All Ages",
        "source": "https://mprove.de/visionreality/media/kay72.html",
        "key_text": "For many years it has been a tradition to attempt to cure our society's ills through technology: 'You have slums? Let's build low-cost housing!' 'You can't afford that TV? We'll build a cheaper one and you can buy it on time, even though it will break before you've finished paying for it!' 'Your kids aren't learning and education is too expensive? We'll build you a teaching machine which will guarantee your kids will pass tests!' Unfortunately, most of these 'cures' are no more than paint over rust; the sources of the initial problems still remain.",
        "why_interesting": "",
        "screenshot": "dynabooks.jpg"
    },
    {
        "title": "A Lesson on Elementary Worldly Wisdom As It Relates To Investment Management & Business",
        "source": "https://fs.blog/great-talks/a-lesson-on-worldly-wisdom",
        "key_text": "Well, the first rule is that you can’t really know anything if you just remember isolated facts and try and bang ’em back. If the facts don’t hang together on a latticework of theory, you don’t have them in a usable form.You’ve got to have models in your head. And you’ve got to array your experience—both vicarious and direct—on this latticework of models. You may have noticed students who just try to remember and pound back what is remembered. Well, they fail in school and in life. You’ve got to hang experience on a latticework of models in your head.",
        "why_interesting": "",
        "screenshot": "munger-buffett.webp"
    },
    {
        "title": "A GPT-4 Capability Forecasting Challenge",
        "source": "https://nicholas.carlini.com/writing/llm-forecast/question/Capital-of-Paris",
        "key_text": "This is a game that tests your ability to predict ('forecast') how well GPT-4 will perform at various types of questions.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "All grown up and no place to go",
        "source": "https://meduza.io/en/feature/2021/12/18/all-grown-up-and-no-place-to-go",
        "key_text": "After the end, in the 1990s, we watched from below as our parents, brothers, and sisters tried to grab their chance; most, of course, didn’t catch it, but we thought when the time comes we wouldn’t miss ours. When it came, it turned out that everything that could’ve been ours was already someone else’s.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Alarming Navy Intel Slide Warns Of China’s 200 Times Greater Shipbuilding Capacity",
        "source": "https://www.twz.com/alarming-navy-intel-slide-warns-of-chinas-200-times-greater-shipbuilding-capacity",
        "key_text": "The graphic shows that China’s shipyards have a capacity of around 23,250,000 tons versus less than 100,000 tons in the United States. That is at least an astonishing 232 times greater than the United States.",
        "why_interesting": "",
        "screenshot": "us-china-ship-building-capacity.webp"
    },
    {
        "title": "Al-Assad’s Soldiers Hope for Amnesty. First, They Have to Take a Number.",
        "source": "https://www.nytimes.com/2024/12/18/world/middleeast/syria-assad-soldier-amnesty.html",
        "key_text": "During its decades-long rule, the Assad government built a brutal security apparatus, detaining, torturing and executing opponents. Last week, the rebel coalition that overthrew him said it would hunt down senior officials implicated in crimes, while rank-and-file conscripted soldiers would receive amnesty. More than 600 people came when the so-called reconciliation center first opened on Sunday in Latakia, in a province that has been an Assad stronghold. Many more followed on Monday, the line extending the length of the large security compound.",
        "why_interesting": "Bureaucracy always pops up.",
        "screenshot": ""
    },
    {
        "title": "In Praise of Idleness",
        "source": "https://harpers.org/archive/1932/10/in-praise-of-idleness/",
        "key_text": "I think that there is far too much work done in the world, that immense harm is caused by the belief that work is virtuous, and that what needs to be preached in modern industrial countries is quite different from what always has been preached.",
        "why_interesting": "",
        "screenshot": "bertrand-russell-child.jpg"
    },
    {
        "title": "Theodore Hall Wikipedia",
        "source": "https://en.wikipedia.org/wiki/Theodore_Hall",
        "key_text": "In June 1946, Hall's security clearance was revoked by the US Army, not over suspicions of being a Soviet asset but because of discovery of a letter he had received from his British sister-in-law, his brother Edward's wife Edith, who inquired jokingly of him: \"I hear you're working on something that goes up with a big bang! Can you send us one of them for Guy Fawkes Day?\"",
        "why_interesting": "Theodore Hall got betrayed as Soviet spy by his aunt because she mentioned having heard he's working on something that goes up with a big bang.",
        "screenshot": "theodore-hall.jpg"
      },
      {
        "title": "How to Stage a Coup",
        "source": "https://www.statecraft.pub/p/how-to-commit-a-coup",
        "key_text": "For example, King Hassan II of Morocco was the victim of a coup. His airplane was to be shot down coming back from Paris, but he landed and became very energetic, took control of the airbase, and then eventually tracked down the organizer of the coup, who was the minister of the interior, General Mohamed Oufkir. According to King Hassan's New York Times obituary, \"When pilots of his air force attacked his Boeing 727 jetliner, the King, himself a pilot, seized the radio and shouted, 'Stop firing! The tyrant is dead!' — fooling the rebels into breaking off their attack.\"",
        "why_interesting": "King Hassan II called himself a tyrant to fool the rebels.",
        "screenshot": "king-hassan-2.jpg"
      },
      {
        "title": "Time For Light interview Screaming Trees",
        "source": "https://archive.ph/crQNh",
        "key_text": "One of the high points both for Martin, and the Trees in general, came when President Clinton used the drum riff from \"Nearly Lost You\" as the background during the Inauguration ceremony. \"It was really weird, these tribal drums; but I thought it was pretty cool because I came up with that part.\"",
        "why_interesting": "Bill Clinton used the drum riff from \"Nearly Lost You\" as background music during his Inauguration ceremony.",
        "screenshot": "bill-clinton-inauguration-1993.jpg"
      },
      {
        "title": "Russian Word for Queen in Chess",
        "source": "",
        "key_text": "",
        "why_interesting": "The Russian word for queen in chess is masculine.",
        "screenshot": "russian-word-queen-male.png"
      },
      {
        "title": "Soorin Kim Twitter",
        "source": "https://twitter.com/SooRinKimm/status/1749706123639214132",
        "key_text": "You actually hear the Smiths more often than you'd think at 2024 Trump rallies.",
        "why_interesting": "Trump plays The Smiths Please, Please, Please, Let Me Get What I Want at rallies.",
        "screenshot": "hatful-of-hollow.jpg"
      },
      {
        "title": "Commodus the gladiator",
        "source": "https://en.wikipedia.org/wiki/Commodus#Commodus_the_gladiator",
        "key_text": "Commodus also had a passion for gladiatorial combat, which he took so far as to take to the arena himself, dressed as a secutor. The Romans found Commodus' gladiatorial combat to be scandalous and disgraceful. According to Herodian, spectators of Commodus thought it unbecoming of an emperor to take up arms in the amphitheater for sport when he could be campaigning against barbarians among other opponents of Rome. The consensus was that it was below his office to participate as a gladiator.",
        "why_interesting": "Trump acts like Commodus.",
        "screenshot": "commodus-in-arena.jpg"
      },
      {
        "title": "Yandex founder Arkady Volozh says he hired security detail after Putin hinted at Prigozhin's demise",
        "source": "https://meduza.io/en/news/2025/01/10/yandex-founder-arkady-volozh-says-he-hired-a-security-detail-after-putin-called-him-a-talented-person-the-same-phrase-he-used-when-commenting-on-prigozhin-s-violent-death",
        "key_text": "In August 2023, the Russian president publicly described the tech entrepreneur as \"a talented person\" — the same language he'd recently used when commenting on the violent death of mercenary leader Yevgeny Prigozhin, who perished with several others in a plane crash under suspicious circumstances, two months after his brief but shocking armed insurrection.",
        "why_interesting": "When Putin calls you a talented person, you have to fear for your life.",
        "screenshot": "putin-volozh.webp"
      },
      {
        "title": "WarGonzo",
        "source": "https://meduza.io/en/feature/2025/01/10/america-has-legitimized-redrawing-the-world-map",
        "key_text": "And we'll turn a blind eye to the liberation of Canada. Except for Quebec, of course — it should return to its rightful home in France. But only after Marine Le Pen comes to power there.",
        "why_interesting": "Russian war bloggers are already thinking of returning Quebec to France after the American war between the USA and Canada.",
        "screenshot": "france-quebec.jpg"
      },
      {
        "title": "Tehanu",
        "source": "https://www.tehanu.io/",
        "key_text": "Animals, trees, and many other species are essential to the global economy. Our world cannot prosper if only humans benefit from its resources. Tehanu exists in the belief that these species need to participate in our economy in order to survive.",
        "why_interesting": "Tehanu wants to extends the gig economy to animals.",
        "screenshot": "tehanu.webp"
      },
      {
        "title": "Anthropic jobs boards",
        "source": "https://boards.greenhouse.io/anthropic/jobs/4462114008",
        "key_text": "They will build and maintain strong relationships with our Human Feedback (HF) resources and optimize how we do this work on an ongoing basis.",
        "why_interesting": "Anthropic calls people human feedback resources.",
        "screenshot": ""
      },
      {
        "title": "Максим Кац",
        "source": "https://www.youtube.com/watch?v=NyhCZvFE0C4",
        "key_text": "Apple has a market cap of over $2.5 trillion. If you consider the aggregate budget of Russia, Apple's market cap should be covering all the costs for five years.",
        "why_interesting": "Market cap Apple covers 5 years of the Russia budget.",
        "screenshot": "maxim-katz.png"
      },
      {
        "title": "62 Fascinating Facts of 2024",
        "source": "https://www.nytimes.com/2024/12/31/insider/-ifacts-2024.html",
        "key_text": "Only 15 percent of previously married women say they want to do it again, according to a Pew Center for Research study. That's half the portion of men who want to remarry.",
        "why_interesting": "Only 15 percent of previously married women say they want to do it again.",
        "screenshot": "62-fascinating-facts-2024.webp"
      },
      {
        "title": "Why we stopped making Einsteins",
        "source": "https://www.theintrinsicperspective.com/p/why-we-stopped-making-einsteins",
        "key_text": "In fact, there was a family tutor of the Einsteins who went by the name Max Talmud (possibly the best name of a tutor ever), and it was indeed Max Talmud who introduced the young 12-year-old Albert to geometry, prefacing young Albert's eventual transformation of our understanding of space and time into something geometric. Maybe we don't make Einsteins anymore because we don't make Max Talmuds anymore.",
        "why_interesting": "Einstein's tutor was called Max Talmud.",
        "screenshot": "max-talmud.jpg"
      },
      {
        "title": "Don't believe him",
        "source": "https://www.nytimes.com/video/opinion/100000009968320/dont-believe-him.html",
        "key_text": "Steve Bannon: The opposition party is the media. And the media can only, because they're dumb and they're lazy, they can only focus on one thing at a time. … All we have to do is flood the zone. Every day we hit them with three things. They'll bite on one, and we'll get all of our stuff done. Bang, bang, bang. These guys will never — will never be able to recover. But we've got to start with muzzle velocity.",
        "why_interesting": "Steve Bannon calls overwhelming the media muzzle velocity.",
        "screenshot": "muzzle-velocity.jpg"
      },
      {
        "title": "Myspace Wikipedia",
        "source": "https://en.wikipedia.org/wiki/Myspace",
        "key_text": "In June 2006, it surpassed Yahoo and Google to become the most visited website in the United States.",
        "why_interesting": "At one point in time Myspace was visited more than Google.",
        "screenshot": "memento-mori.webp"
      },
      {
        "title": "Anima archives",
        "source": "https://animafestival.be/animafestival/up/a-propos/Archives/1991/1991-compressed.pdf",
        "key_text": "",
        "why_interesting": "Anima festival used to be sponsored by Bifi.",
        "screenshot": "bifi-sponsor-anima-festival.png"
      },
      {
        "title": "Nam-ı Kemal jokes",
        "source": "https://en.m.wikipedia.org/wiki/Nam-%C4%B1_Kemal_jokes",
        "key_text": "Nam-ı Kemal jokes (Turkish: Nâm-ı Kemâl fıkraları) are a variety of dirty jokes in Turkish folk literature that originated during the Ottoman era. In the archaic Ottoman Turkish language, the phrase nam-ı Kemal means \" a man named Kemal\", i.e. a generic and unconventionally humorous everyman. However, due to the phrase's vocal similarity with the name of one of the most foremost figures in Turkish literature, the poet and playwright Namık Kemal (1840–1888), the jokes underwent an evolution. With the growing obscurity of Ottoman terms among most speakers of modern Turkish, \"nam-ı Kemal jokes\" became, more often than not, \"Namık Kemal jokes\", an example of a mondegreen. The obscenity of the \"nam-ı Kemal jokes\" tradition is based mainly on phallic exaggerations.",
        "why_interesting": "Nam-ı Kemal jokes are dirty jokes in Turkish.",
        "screenshot": "namik-kemal.jpg"
      }
]