[
    {
        "title": "Toyota War",
        "source": "https://en.wikipedia.org/wiki/Toyota_War",
        "key_text": "The Toyota War, also known as the Great Toyota War, which took place in 1987 in Northern Chad and on the Chad–Libya border, was the last phase of the Chadian–Libyan War. It takes its name from the Toyota pickup trucks, primarily the Toyota Hilux and the Toyota Land Cruiser, used to provide mobility for the Chadian troops as they fought against the Libyans, and as technicals.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "LLMs as Method Actors: A Model for Prompt Engineering and Architecture",
        "source": "https://arxiv.org/abs/2411.05778v2",
        "key_text": "When asked to solve a puzzle all at once, o1-preview solves 79% of Connections puzzles in our dataset, and when allowed to build puzzle solutions one guess at a time over multiple API calls, o1-preview solves 100% of the puzzles. ",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Street smarts: how a hawk learned to use traffic signals to hunt more successfully",
        "source": "https://www.frontiersin.org/news/2025/05/23/street-smarts-hawk-use-traffic-signals-hunting",
        "key_text": " A Cooper’s hawk, a medium-sized raptor native to North America, appears to have learned how to adapt its hunting strategy and strike at a flock of birds precisely when cars at an intersection lined up after traffic lights switched to red, having been alerted by a sound signal that the red phase would last longer than usual.",
        "why_interesting": "",
        "screenshot": "cooper-hawk.webp"
    },
    {
        "title": "Avadhanam",
        "source": "https://en.wikipedia.org/wiki/Avadhanam",
        "key_text": "Avadhānaṃ (literally meaning \"concentration\") is a genre of performance in India, where a performer (called the avadhāni) answers challenging questions from several questioners in parallel.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Don’t Believe the AI Hype",
        "source": "https://www.project-syndicate.org/commentary/ai-productivity-boom-forecasts-countered-by-theory-and-data-by-daron-acemoglu-2024-05",
        "key_text": "Early adoption of generative AI has naturally occurred where it performs reasonably well, meaning tasks for which there are objective measures of success, such as writing simple programming subroutines or verifying information. Here, the model can learn on the basis of outside information and readily available historical data. But many of the 4.6% of tasks that could feasibly be automated within ten years – evaluating applications, diagnosing health problems, providing financial advice – do not have such clearly defined objective measures of success, and often involve complex context-dependent variables (what is good for one patient will not be right for another).",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Why does the world have such an intense stake in Israel/Palestine?",
        "source": "https://aeon.co/essays/why-does-the-world-have-such-an-intense-stake-in-israel-palestine",
        "key_text": "Palestine has become a palimpsest onto which people around the world project problems within their own countries, adding another layer of commitment – and, often, distortion.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Why the deep learning boom caught almost everyone by surprise",
        "source": "https://www.understandingai.org/p/why-the-deep-learning-boom-caught",
        "key_text": "So the AI boom of the last 12 years was made possible by three visionaries who pursued unorthodox ideas in the face of widespread criticism. One was Geoffrey Hinton, a University of Toronto computer scientist who spent decades promoting neural networks despite near-universal skepticism. The second was Jensen Huang, the CEO of Nvidia, who recognized early that GPUs could be useful for more than just graphics.\n\nThe third was Fei-Fei Li. She created an image dataset that seemed ludicrously large to most of her colleagues. But it turned out to be essential for demonstrating the potential of neural networks trained on GPUs.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "The Evolution of Trust",
        "source": "https://ncase.me/trust/",
        "key_text": "I think game theory can help explain our epidemic of distrust –\nand how we can fix it!",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Wrong",
        "source": "https://nealstephenson.substack.com/p/wrong-1",
        "key_text": "During COVID I went down something of a rabbit hole on the subject of wrongness, and wrote some essays into a OneDrive folder that I had established on a new PC. ",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Spaced Repetition Systems Have Gotten Way Better",
        "source": "https://domenic.me/fsrs/",
        "key_text": "Stepping back, my takeaway from this experience is that Anki is king. People complain about how its UI is created by developers instead of designers, or how you have to find or make your own decks instead of using prepackaged ones. These are all fair complaints. But Anki is maintained by people who actually care about learning efficiently. It receives frequent updates that make it better at that goal. And it’s flexible enough to carry you through any stage of your knowledge-acquisition journey. Putting in the time to master it will provide a foundation that lasts you a literal lifetime.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "The Unreasonable Effectiveness of an LLM Agent Loop with Tool Use",
        "source": "https://sketch.dev/blog/agent-loop",
        "key_text": "I have no doubt that agent loops will get incorporated into more day to day automation tedium that's historically been too specific for general purpose tools and too esoteric and unstable to automate traditionally. I keep thinking of how much time I've spent correlating stack traces with git commits, and how good LLMs are at doing a first pass on it. ",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Rampant AI Cheating Is Ruining Education Alarmingly Fast",
        "source": "https://web.archive.org/web/20250507231632/https://nymag.com/intelligencer/article/openai-chatgpt-ai-cheating-education-college-students-school.html",
        "key_text": "The ideal of college as a place of intellectual growth, where students engage with deep, profound ideas, was gone long before ChatGPT. The combination of high costs and a winner-takes-all economy had already made it feel transactional, a means to an end.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Will the Humanities Survive Artificial Intelligence?",
        "source": "https://web.archive.org/web/20250426101126/https://www.newyorker.com/culture/the-weekend-essay/will-the-humanities-survive-artificial-intelligence",
        "key_text": "On the contrary, staggering transformations are in full swing. And yet, on campus, we’re in a bizarre interlude: everyone seems intent on pretending that the most significant revolution in the world of thought in the past century isn’t happening. The approach appears to be: “We’ll just tell the kids they can’t use these tools and carry on as before.” This is, simply, madness. And it won’t hold for long. It’s time to talk about what all this means for university life, and for the humanities in particular.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Grigory’s Ode to Joy Facing six years in prison",
        "source": "https://meduza.io/en/feature/2025/05/13/grigory-s-ode-to-joy",
        "key_text": "This case is missing the very foundation of any criminal prosecution: the occurrence of a crime. ",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Using static websites for tiny archives",
        "source": "https://alexwlchan.net/2024/static-websites/",
        "key_text": "Introducing a bit of friction is helping me to decide what I really care about saving. What’s worth taking the time to organise properly, and what can’t I be bothered with? If I don’t want to take even a minute to save it, am I going to look at it again? But if I do save something, I’ve become more willing to take time to write proper metadata, in a way that will make it easier to find later.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "People watching",
        "source": "http://www.eringreenauthor.co.uk/blog/people-watching",
        "key_text": "I used to write in public places, cafes and libraries but recent observations have distracted me from my writing, filling me with sadness and an instant desire to withdraw to my desk. As a species we seem to be losing the ability to truly connect, to empathise or show kindness towards others. I’m hoping this current trend is simply a phase that will pass as readily as it seems to have appeared, enabling ‘people watching’ to return to the guilty pleasure it once was.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Timeful Texts",
        "source": "https://numinous.productions/timeful/",
        "key_text": "Consider texts like the Bible and the Analects of Confucius. People integrate ideas from those books into their lives over time—but not because authors designed them that way. Those books work because they’re surrounded by rich cultural activity. Weekly sermons and communities of practice keep ideas fresh in readers’ minds and facilitate ongoing connections to lived experiences. This is a powerful approach for powerful texts, requiring extensive investment from readers and organizers. We can’t build cathedrals for every book. Sophisticated readers adopt similar methods to study less exalted texts, but most people lack the necessary skills, drive, and cultural contexts. How might we design texts to more widely enable such practices?",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Anonymous artists",
        "source": "https://en.wikipedia.org/wiki/Category:Anonymous_artists",
        "key_text": "In art history, an anonymous master is an Old Master whose work is known, but whose name is lost. ",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Analogy and the Roots of Creative Intelligence",
        "source": "https://thereader.mitpress.mit.edu/analogy-and-the-roots-of-creative-intelligence/",
        "key_text": "For example, the earliest scientific theory still accepted today — the wave theory of sound — was proposed by a Roman engineer who noticed an analogy between the behavior of sound and water. Sound rebounds off barriers, creating an echo, much as water waves rebound off the shore. Thinking by analogy can foster creative thinking when something puzzling triggers the recognition of a similar situation that is easier to understand.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Ask HN: What are you working on? (April 2025)",
        "source": "https://news.ycombinator.com/item?id=43815523",
        "key_text": "I used to work for Lark. They raised $140mm to solve this problem and the best they could do was a non-ai chatbot that whined at users for not eating enough vegetables. The Lark app has 100% user drop off in 60 days and yet is still the silicon darling in the diabetes space.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "The Anti-Social Century",
        "source": "https://www.theatlantic.com/magazine/archive/2025/02/american-loneliness-personality-politics/681091/",
        "key_text": "Today, the typical American adult buys about three movie tickets a year—and watches almost 19 hours of television, the equivalent of roughly eight movies, on a weekly basis. In entertainment, as in dining, modernity has transformed a ritual of togetherness into an experience of homebound reclusion and even solitude.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Orbit",
        "source": "https://withorbit.com/",
        "key_text": "When you read a text that’s written with Orbit, you don’t just read it once and then set it aside, perhaps forever. The review sessions keep you in contact with the ideas, returning you to the material again and again over weeks and months. The ongoing practice changes your relationship to what you read. It gives you a way to bring ideas into your orbit.",
        "why_interesting": "",
        "screenshot": "orbit.png"
    },
    {
        "title": "The Totalitarian Buddhist Who Beat Sim City",
        "source": "https://www.vice.com/en/article/the-totalitarian-buddhist-who-beat-sim-city/",
        "key_text": "Technically, no one is leaving or coming into the city. Population growth is stagnant. Sims don’t need to travel long distances, because their workplace is just within walking distance. In fact they do not even need to leave their own block. Wherever they go it’s like going to the same place.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Modern-Day Oracles or Bullshit Machines?",
        "source": "https://thebullshitmachines.com/lesson-1-autocomplete-in-overdrive/index.html",
        "key_text": "We find it absolutely amazing that simply by predicting the next words in a stream of text, an algorithm can do all of the things that ChatGPT does. ",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Writing an LLM from scratch, part 1",
        "source": "https://www.gilesthomas.com/2024/12/llm-from-scratch-1",
        "key_text": "The next thing that people discovered was that the encoder and the decoder were actually useful on their own. I've heard models described as \"encoder-only\" or \"decoder-only\" -- GPT-based LLMs being one of the latter -- and this explains where that terminology came from.\n\nAn example of a encoder-only model is BERT, which I know is used heavily for classification tasks; indeed, Answer.AI recently announced ModernBERT, an updated version that is targeting exactly that. This makes some kind of intuitive sense to me. If you have something that is designed to take in text input and produce an embedding that represents its meaning (in some sense) then tacking on an extra layer to convert that meaning into \"the tone of this text is happy/sad/angry/etc\" doesn't feel like a huge lift.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "On the benefits of learning in public",
        "source": "https://www.gilesthomas.com/2025/02/20250223-til-deep-dive-posts",
        "key_text": "I've also spent some time reading through the archives here, and come to the conclusion that the best posts I've made -- at least from my perspective -- follow a similar pattern. They're posts where I've been learning how to do something, or how something worked, and presented what I've found as a summary, often as a tutorial.\n\nI think of these as writing the post that I wished I'd found when I started learning whatever it was.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Plain Vanilla",
        "source": "https://plainvanillaweb.com/index.html",
        "key_text": " Modern web development frameworks are powerful in their ability to develop rich well-structured web applications quickly, and for this reason alone they are well worth your time to learn. However, this rich functionality comes at the cost of framework and tooling complexity, and the resulting projects often require regular maintenance to keep secure and up to date.\n\nThe plain vanilla style of web development makes a different choice, trading off a few short term comforts for long term benefits like simplicity and being effectively zero-maintenance. This approach is made possible by today's browser landscape, which offers excellent web standards support. ",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "The Last Ringbearer",
        "source": "https://dotat.at/tmp/LastRB.pdf",
        "key_text": "Haddami was a genius\ngraphologist able to put together a complete psychological profile of an author and then\nmorph into him, so that the texts he wrote in other people’s names were authentic, in a way.\nAfter the maestro told Haladdin everything he had learned about him from a few\nhandwritten lines, the doctor experienced bewilderment liberally spiced with fear – this was\nreal magic, and not benign, either. For a moment Haladdin was even sorely tempted to show\nthe maestro some notes of Tangorn’s, although he clearly realized that this would have been\neven worse than simply snooping in someone’s private diary. No one has the right to know\nmore about a person than he is willing to tell, and both friendship and love die together with\nthe person’s right to privacy.",
        "why_interesting": "Description black magic in book 'The Last Ringbearer' exists in real life, it's called an LLM.",
        "screenshot": "last-ringbearer-cover.jpg"
    },
    {
        "title": "Techniques for improving text-to-SQL",
        "source": "https://cloud.google.com/blog/products/databases/techniques-for-improving-text-to-sql",
        "key_text": "Current state-of-the-art LLMs like Gemini 2.5 have reasoning capabilities that make them good at translating complex questions posed in natural language to functioning SQL, complete with joins, filters, aggregations and other difficult concepts.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Ditching Obsidian and building my own",
        "source": "https://amberwilliams.io/blogs/building-my-own-pkms",
        "key_text": "No longer do we need to install a random developer's plugin that sends our private thoughts who knows where. We can vibe-code our own or use open-source tooling. I used to use an Obsidian plugin to pull uncompleted tasks from todo checklists that were scattered around various notes, but after 10 minutes of prompting Anthropic's Claude, I had my own private equivalent tool.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "How And Why To Keep A 'Commonplace Book'",
        "source": "https://ryanholiday.net/how-and-why-to-keep-a-commonplace-book/",
        "key_text": "A commonplace book is a central resource or depository for ideas, quotes, anecdotes, observations and information you come across during your life and didactic pursuits.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Remarks on AI from NZ",
        "source": "https://nealstephenson.substack.com/p/remarks-on-ai-from-nz",
        "key_text": "I follow conversations among professional educators who all report the same phenomenon, which is that their students use ChatGPT for everything, and in consequence learn nothing. We may end up with at least one generation of people who are like the Eloi in H.G. Wells’s The Time Machine, in that they are mental weaklings utterly dependent on technologies that they don’t understand and that they could never rebuild from scratch were they to break down.",
        "why_interesting": "",
        "screenshot": "wells-the-time-machine.jpg"
    },
    {
        "title": "What The Hell Are People Doing?",
        "source": "https://humans.maxcomperatore.com/how.html",
        "key_text": "The \"What The Hell Are People Doing?\" dashboard presents a dynamic, illustrative simulation of estimated global human activities in real-time. It aims to provide a thought-provoking and engaging perspective on how humanity collectively spends its time, visualized through constantly updating statistics and a global day/night map.",
        "why_interesting": "",
        "screenshot": "dashboard-what-the-hell-are-people-doing.png"
    },
    {
        "title": "How the last letters of the condemned can teach us how to live",
        "source": "https://aeon.co/essays/how-the-last-letters-of-the-condemned-can-teach-us-how-to-live",
        "key_text": "Last letters are unlike any other type of writing I have ever encountered. They are of a singular ilk because they peer into the souls of those confronting imminent and inescapable death. Different from everyday letters, diaries, memoirs, political tracts or philosophical treatises, because of the urgency that shapes the act of writing. The authors know there will not be another chance to say what must be said.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Israel’s A.I. Experiments in Gaza War Raise Ethical Concerns",
        "source": "https://www.nytimes.com/2025/04/25/technology/israel-gaza-ai.html",
        "key_text": "One tool developed by “The Studio” was an Arabic-language A.I. model known as a large language model, three Israeli officers familiar with the program said. (The large language model was earlier reported by Plus 972, an Israeli-Palestinian news site.)\n\nDevelopers previously struggled to create such a model because of a dearth of Arabic-language data to train the technology. When such data was available, it was mostly in standard written Arabic, which is more formal than the dozens of dialects used in spoken Arabic.\n\nThe Israeli military did not have that problem, the three officers said. The country had decades of intercepted text messages, transcribed phone calls and posts scraped from social media in spoken Arabic dialects. So Israeli officers created the large language model in the first few months of the war and built a chatbot to run queries in Arabic. ",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Mark Zuckerberg personally lost the Facebook antitrust case",
        "source": "https://pluralistic.net/2025/04/18/chatty-zucky/",
        "key_text": "It's damned hard to prove an antitrust case: so often, the prosecution has to prove that the company intended to crush competition, and/or that they raised prices or reduced quality because they knew they didn't have to fear competitors.\n\nIt's a lot easier to prove what a corporation did than it is to prove why they did it. What am I, a mind-reader? But imagine for a second that the corporation in the dock is a global multinational. Now, imagine that the majority of the voting shares in that company are held by one man, who has served as the company's CEO since the day he founded it, personally calling every important shot in the company's history.\n\nNow imagine that this founder/CEO, this accused monopolist, was an incorrigible blabbermouth, who communicated with his underlings almost exclusively in writing, and thus did he commit to immortal digital storage a stream – a torrent – of memos in which he explicitly confessed his guilt.\n\nLadies and gentlepersons, I give you Mark Zuckerberg, founder and CEO of Meta (nee Facebook), an accused monopolist who cannot keep his big dumb fucking mouth shut.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Aliza Magen, Highest-Ranking Woman in the Mossad, Dies at 87",
        "source": "https://www.nytimes.com/2025/04/22/world/middleeast/aliza-magen-dead.html",
        "key_text": "From her base in Austria, she helped recruit a former top-ranking Nazi officer to become a Mossad asset.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Why I reimagined \"LOTR\" from Mordor's perspective",
        "source": "https://www.salon.com/2011/02/23/last_ringbearer_explanation/",
        "key_text": "An apocryphal work – a different take on well-known events (whether from the real or an imaginary world is irrelevant: who are we to judge which is derivative?) -- is totally different. Naturally, the world of an apocryphal work turns out differently, bearing at best the same relation to the initial world as that of d’Artagnan and milady Winter does to real France under Louis the XIII… or is it vice-versa? Actually, upon contemplation, what difference does it make? What’s important is that while the world of a sequel is a reproduction that adds absolutely nothing to the original, the worlds of the canonical and the apocryphal works can ideally make a \"stereoscopic pair\" that adds \"depth\" to the former. ",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "How to live an intellectually rich life",
        "source": "https://utsavmamoria.substack.com/p/how-to-live-an-intellectually-rich",
        "key_text": "Zhang is a classic example of the power of routine. Even in mathematical obscurity, he consistently went to the library and kept abreast of the developments in algebraic geometry and number theory. He worked every day - the same hours, at the same place, with little to no change in his routine. Zhang had finished “Bounded Gaps Between Primes” in late 2012; and then he spent a few months methodically checking each step, which he said was “very boring.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Faking William Morris, Generative Forgery, and the Erosion of Art History",
        "source": "https://maggieappleton.com/generative-forgery",
        "key_text": "The snake eats its own tail. And we scramble a whole generation’s understanding of history, tearing at our already threadbare epistemological fabric.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "VVVVVV Source Code | Hacker News",
        "source": "https://news.ycombinator.com/item?id=43910681",
        "key_text": "One can spend months agonizing over the true nature of things and how ideas and concepts relate to each other and eventually distill it all into some object oriented organization that implements not just your game but all possible games.\n\nOne can also just cycle the game's state machine in a big function, haha switch statement go brrr.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "How Post–Civil War Texas Gunfighters Forged a Bloody Frontier",
        "source": "https://web.archive.org/web/20250505195846/https://www.texasmonthly.com/being-texan/gunfighters-old-west-wilder-bloodier/",
        "key_text": "Brown judged post–Civil War Central Texas the single most violent region in American history. “It was a land without surcease from killing,” he wrote, marked by “an ethic of individual violent self-defense and self-redress.”",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Garth Marenghi's Darkplace E01 'Once Upon a Beginning'",
        "source": "https://www.youtube.com/watch?v=J4hF7948vIg&t=36s",
        "key_text": "Back in the 1980s, I wrote, directed and starred in Garth Marenghi's Darkplace. A TV programme so radical, so risky, so dangerous, so goddamned crazy, that the powers that be became too scared to show it, and gipped me much in the way women have done ever since they sniffed out my money. Only now, in the worst artistic drought in broadcast history, does the channel come crawling back, cap in hand, asking if your humble fabulist could retrieve Darkplace from the boxes in his basement and let it loose on its unsuspecting public. That's you. Naturellement, I relented.",
        "why_interesting": "",
        "screenshot": "garth-marenghi-doctor.png"
    },
    {
        "title": "I'd rather read the prompt | Hacker News",
        "source": "https://news.ycombinator.com/item?id=43888803#:~:text=Further%2C%20if%20a,by%20the%20automation",
        "key_text": "Society will radically shift into one where critical thinking skills will actually be the only skills employers look for in employees, since the grunt work can be automated.\n\nWhat becomes the signal then? Will we shift back into apprenticeship based employment? How do potential laborers display their critical thinking skills apart from displaying them in person?",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "The Curse of Knowing How or Fixing Everything",
        "source": "https://notashelf.dev/posts/curse-of-knowing",
        "key_text": "I’m trying to let things stay a little broken. Because I’ve realized I don’t want to fix everything. I just want to feel OK in a world that often isn’t. I can fix something, but not everything.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Creative Arabic Calligraphy for Beginners: Introduction",
        "source": "https://design.tutsplus.com/tutorials/creative-arabic-calligraphy-for-beginners-introduction--cms-22116",
        "key_text": "In pre-Islamic days, writing was known to the peoples of the Arabian peninsula, and a rudimentary Arabic script was in use. It was rudimentary because they had little use for it, being a culture with a strong oral tradition, and the earliest texts that have come to us show all the awkwardness of a system that hasn't yet found its legs. Then, almost overnight, they found themselves in the possession of something that needed to be preserved not only word for word, but down to the pauses between the words. That was the Qur'an, and it required a worthy transcription, with Arabic acquiring a special status, being seen as the language God chose for His revelation. The letters of the alphabet were now magical beings since they were capable of holding and preserving the divine Word. ",
        "why_interesting": "",
        "screenshot": "kufic-script.jpg"
    },
    {
        "title": "‘Millions of flies in the evidence room’: inside Belgium’s rotting Justice Palace",
        "source": "https://www.ft.com/content/0b72735a-b587-4dd3-a1ac-2805c89f5d2f?accessToken=zwAGNHaWDv1wkc8LcnNatYdN09OhrCgFyJ9dLw.MEYCIQDoEh2fKU9s_S1WmLhDkyGiXjfnIYMF9v1_ZnjvSP9wOAIhALm5ZGCHtP6bfUcduZIq4CFd2VDCxRYnoG5fGuxB4pvZ&sharetype=gift&token=e83b7411-5662-41f4-b46c-a29e4cc9a712",
        "key_text": "In the southern city of Nivelles, a murder trial was dismissed last year because the file had become unreadable due to humidity and fungus.",
        "why_interesting": "",
        "screenshot": "lady-justice-belgium.avif"
    },
    {
        "title": "Bestaat de offline tienerkamer nog?",
        "source": "https://www.standaard.be/binnenland/bestaat-de-offline-tienerkamer-nog-ik-heb-niet-de-neiging-om-te-ontsnappen-in-mijn-slaapkamer.-in-de-woonkamer-is-het-gezellig-genoeg/64076513.html",
        "key_text": "Marieke lacht, praat en straalt. Maar haar kamer is kaal. Op de vensterbank staat een magere vetplant. Op drie papieren bloemen na is er niks. Haar nachtkastje is leeg. De muren zwijgen. Zonder Marieke in beeld, wekt de kamer verbijstering. De verbazing verbaast haar. “Leeftijdsgenoten zullen niet zo snel reageren van ‘Amai, jouw kamer is niet versierd!’ Mijn vriendinnen hebben kamers die redelijk vergelijkbaar zijn.”",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Onfim's world",
        "source": "https://resobscura.substack.com/p/onfims-world-medieval-child-artists",
        "key_text": "These children, who lived around the year 1250 CE, were meant to be learning how to read and write. But one student named Onfim used them to draw. And for this reason, Onfim has become immortal.",
        "why_interesting": "",
        "screenshot": "onfim.webp"
    },
    {
        "title": "Chess Proverbs by Edward Winter",
        "source": "https://www.chesshistory.com/winter/extra/proverbs.html",
        "key_text": "Chess is a sea in which a gnat may drink and an elephant may bathe.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Stasi Tactics – Zersetzung",
        "source": "https://www.maxhertzberg.co.uk/background/politics/stasi-tactics/",
        "key_text": "The Zersetzung of individuals had the aim of ‘switching off’ that person’s efficacy by undermining their confidence and their belief in the value of their activities. The Stasi did not usually care whether an individual was switched off through disillusionment, fear, burn-out or mental illness: all outcomes were acceptable, and people’s mental health and social standing during or after an operation were of no concern to the officers involved.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "The Creativity Hack No One Told You About: Read the Obits",
        "source": "https://thereader.mitpress.mit.edu/the-creativity-hack-no-one-told-you-about-read-the-obits/",
        "key_text": "Reading obituaries can boost creativity by exposing you to distant ideas, fueling the associations that lead to unexpected breakthroughs.",
        "why_interesting": "",
        "screenshot": "nyt-obituaries.jpg"
    },
    {
        "title": "Sam Patterson",
        "source": "https://sampatt.com/blog/2025-04-28-can-o3-beat-a-geoguessr-master",
        "key_text": "In a head-to-head Geoguessr match, OpenAI’s o3 model out-scored me—a Master I–ranked human—23,179 to 22,054, correctly identifying all five countries and twice landing within a few hundred metres.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Daft Punk - Giorgio by Moroder Lyrics",
        "source": "https://genius.com/Daft-punk-giorgio-by-moroder-lyrics",
        "key_text": "When I was fifteen, sixteen, when I really started to play guitar, I definitely wanted to become a musician. It was almost impossible because—it was—the dream was so big that I didn't see any chance because I was living in a little town; was studying. And when I finally broke away from school and became a musician, I thought, 'Well, now I may have a little bit of a chance,' because all I really wanted to do is music. And not only play music, but compose music. At that time, in Germany, in '69, '70, they had already discotheques. So, I would take my car, would go to a discotheque, sing maybe thirty minutes. I think I had about seven, eight songs. I would partially sleep in the car because I didn't want to drive home and that helped me for about almost two years to survive in the beginning. I wanted to do an album with the sounds of the '50s, the sounds of the '60s, of the '70s, and then have a sound of the future. And I said, 'Wait a second, I know the synthesizer. Why don't I use the synthesizer which is the sound of the future?' And I didn't have any idea what to do, but I knew I needed a click, so we put a click on the 24-track, which then was synced to the Moog Modular. I knew that could be a sound of the future, but I didn't realize how much the impact would be. My name is Giovanni Giorgio, but everybody calls me Giorgio.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Linux for PlayStation 2",
        "source": "https://en.m.wikipedia.org/wiki/Linux_for_PlayStation_2",
        "key_text": "Linux for PlayStation 2 (or PS2 Linux) is a kit released by Sony Computer Entertainment in 2002 that allows the PlayStation 2 console to be used as a personal computer.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Artificial General Intelligence Is Already Here",
        "source": "https://www.noemamag.com/artificial-general-intelligence-is-already-here/",
        "key_text": "Today’s most advanced AI models have many flaws, but decades from now, they will be recognized as the first true examples of artificial general intelligence.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "How We Investigated France’s Mass Profiling Machine",
        "source": "https://www.lighthousereports.com/methodology/how-we-investigated-frances-mass-profiling-machine/",
        "key_text": "Nearly half of France’s population is scored each year by the model...All of the three models are written in SAS, a programming language designed for statistical analysis. ",
        "why_interesting": "SAS...",
        "screenshot": ""
    },
    {
        "title": "Teach Yourself Programming in Ten Years",
        "source": "https://www.norvig.com/21-days.html",
        "key_text": "The key is deliberative practice: not just doing it again and again, but challenging yourself with a task that is just beyond your current ability, trying it, analyzing your performance while and after doing it, and correcting any mistakes. Then repeat. And repeat again. There appear to be no real shortcuts.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Daft Punk - Interview in Japan (Discovery Release) With Real Voices",
        "source": "https://www.youtube.com/watch?v=mLPaSp1Q0yw",
        "key_text": "",
        "why_interesting": "",
        "screenshot": "daft-punk-interview.png"
    },
    {
        "title": "Recreating Daft Punk's Something About Us",
        "source": "https://thoughts-and-things.ghost.io/recreating-daft-punks-something-about-us/",
        "key_text": "An in-depth, personal journey recreating Daft Punk’s “Something About Us” in Ableton Live 12—track by track. From synths to talkbox guitars, a nostalgic dive into French Touch culture, sound design, and the joys of music production... When learning a new music production software, recreating a cover track is always a smart move. You don't have to worry too much about the songwriting itself, which frees you up to focus on the tools and the production process.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "What If We Made Advertising Illegal?",
        "source": "https://simone.org/advertising/",
        "key_text": "Ad companies are never going to regulate themselves—it's like hoping for heroin dealers to write drug laws.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "American Disruption",
        "source": "https://stratechery.com/2025/american-disruption/",
        "key_text": "The most important components for executing a fundamental shift in trade are those that go into building actual factories, or equipment for those factories. In the vast sea of stupidity that are these tariffs this is perhaps the stupidest detail of all: the U.S. is tariffing raw materials and components for factory equipment, like CNC machines.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "The Best Programmers I Know",
        "source": "https://endler.dev/2025/best-programmers/",
        "key_text": "Great devs understand the technologies they use on a fundamental level.\n\nIt’s one thing to be able to use a tool and a whole other thing to truly grok (understand) it.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "How to use Gemini Live with camera and screen sharing",
        "source": "https://blog.google/products/gemini/gemini-live-android-tips/",
        "key_text": "Gemini Live lets you have natural, free-flowing conversations with Gemini in over 45 different languages. ",
        "why_interesting": "",
        "screenshot": "gemini-live.png"
    },
    {
        "title": "DOGE Is Far Short of Its Goal, and Still Overstating Its Progress",
        "source": "https://www.nytimes.com/2025/04/13/us/politics/doge-contracts-savings.html",
        "key_text": "Elon Musk now says his group will produce only 15 percent of the savings it promised. But even that estimate is inflated with errors and guesswork.",
        "why_interesting": "Why wouldn't Tesla's numbers be manipulated in the same way?",
        "screenshot": ""
    },
    {
        "title": "Big Book of R | Hacker News",
        "source": "https://news.ycombinator.com/item?id=43646219",
        "key_text": "R especially dplyr/tidyverse is so underrated. Working in ML engineering, I see a lot of my coworkers suffering through pandas (or occasionally polars or even base Python without dataframes) to do basic analytics or debugging, it takes eons and gets complex so quickly that only the most rudimentary checks get done. Anyone working in data-adjacent engineering work would benefit from R/dplyr in their toolkit.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "garfield minus garfield",
        "source": "https://garfieldminusgarfield.net/",
        "key_text": "Garfield Minus Garfield is a site dedicated to removing Garfield from the Garfield comic strips in order to reveal the existential angst of a certain young Mr. Jon Arbuckle. It is a journey deep into the mind of an isolated young everyman as he fights a losing battle against loneliness and depression in a quiet American suburb. ",
        "why_interesting": "",
        "screenshot": "garfield-thinking-about-things.png"
    },
    {
        "title": "The top 1000 words checker",
        "source": "https://www.benguttmann.com/thousand",
        "key_text": "The 1,000 most commonly used words in English make up about 75% of the language as it’s actually used.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "How To Build An Agent",
        "source": "https://ampcode.com/how-to-build-an-agent",
        "key_text": "This is essentially all there is to the inner loop of a code-editing agent. Sure, integrating it into your editor, tweaking the system prompt, giving it the right feedback at the right time, a nice UI around it, better tooling around the tools, support for multiple agents, and so on — we’ve built all of that in Amp, but it didn’t require moments of genius. All that was required was practical engineering and elbow grease.\n\nThese models are incredibly powerful now. 300 lines of code and three tools and now you’re to be able to talk to an alien intelligence that edits your code. If you think “well, but we didn’t really…” — go and try it! Go and see how far you can get with this. I bet it’s a lot farther than you think.\n\nThat’s why we think everything’s changing.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "A Field Guide to Rapidly Improving AI Products",
        "source": "https://www.oreilly.com/radar/a-field-guide-to-rapidly-improving-ai-products/",
        "key_text": "When identifying error types, you can take either a “top-down” or “bottom-up” approach. The top-down approach starts with common metrics like “hallucination” or “toxicity” plus metrics unique to your task. While convenient, it often misses domain-specific issues. The more effective bottom-up approach forces you to look at actual data and let metrics naturally emerge.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Money laundering and AML compliance",
        "source": "https://www.bitsaboutmoney.com/archive/money-laundering-and-aml-compliance/",
        "key_text": "Money laundering is, effectively, a process crime. We criminalized it not because of the direct harms, but because it tends to make other interdiction of criminal activity more difficult. Money laundering covers anything which obscures the link between another crime and the proceeds of that crime. This is intentionally extremely vague and expansive. The victim is, take your pick, either the state or the financial institutions the state has deputized to detect it.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Saul Teaches Jesse Money Laundering",
        "source": "https://www.youtube.com/watch?v=RhsUHDJ0BFM",
        "key_text": "\"I'm a drug dealer\". Wrong, a million times worse. You're a tax cheat and you know what they do? They take every penny and you go in the can for felony tax evasion. Ouch!",
        "why_interesting": "",
        "screenshot": "better-call-saul.webp"
    },
    {
        "title": "No general method to detect fraud",
        "source": "https://calpaterson.com/fraud.html",
        "key_text": "In this scenario the scammer is starting out writing to a huge number of people, half with a prediction for the market to go up and the other half with a prediction for it to go down. At the end of each month, he discards those to whom he made an inaccurate prediction and splits the rest into two groups, sending new (opposite) predictions to each group. Eventually some of those being scammed \"convert\" (I may as well use the marketing terminology given how closely this resembles an A/B test) and he's able to dupe them into making an investment.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Contra MacAskill and Wiblin on The Intelligence Explosion",
        "source": "https://www.maximum-progress.com/p/contra-macaskill-and-wiblin-on-the",
        "key_text": "What would happen if the previous century of progress were compressed into a decade? Just look around you. We’ve been on this trend for thousands of years. The 20th century was a thousand years of progress or more compressed into century. We've already increased through several orders of magnitude in how fast the world moves, how rapid economic growth is, how much economic activity each person is responsible for, and how much destructive power each person and government can wield.\n\nIf, as MacAskill claims, human decision making hasn’t sped up, we’ve somehow managed to avoid the “holy shit chaos” that Will and Rob predicted would result.\n\nMaybe some particular theory of human psychology and economics can predict that the next speed-up will finally take us over the threshold of human understanding, but just bamboozling with big numbers doesn’t stand up to our already proven success through the even more bamboozling long-view of history.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Martin Heylen Twitter 29-04-2024",
        "source": "https://x.com/MartinHeylen1/status/1784860470073032938",
        "key_text": "Bij een writers block heb neem ik een trein tot aan de terminus en terug. Onderweg komen de zinnen vanzelf. \nTijd voor 1 koffie in Eupen Plaza, naast het perron. En na een kwartier stap ik weer dezelfde trein op. En schrijven maar. ",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "What the Luddites Really Fought Against",
        "source": "https://www.smithsonianmag.com/history/what-the-luddites-really-fought-against-264412/#ixzz2qPY1F6WP",
        "key_text": "Luddite invents machine to destroy technology quicker.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "America Underestimates the Difficulty of Bringing Manufacturing Back — Molson Hart",
        "source": "https://www.molsonhart.com/blog/america-underestimates-the-difficulty-of-bringing-manufacturing-back",
        "key_text": "In short, manufacturing in the United States is so expensive and our supply chain (we’ll explain that next) is so bad that making that iPhone in the United States without that 54% tariff, would still cost more than in China with 54% tariff. Since it still costs less to make the iPhone in China, both Apple and consumers would prefer it be made there, so it will, and not in the USA.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "The Egg",
        "source": "https://www.galactanet.com/oneoff/theegg.html",
        "key_text": "Once you’ve lived every human life throughout all time, you will have grown enough to be born.”\n\n“So the whole universe,” you said, “it’s just…”\n\n“An egg.” I answered. “Now it’s time for you to move on to your next life.”",
        "why_interesting": "",
        "screenshot": "egg-a-ghost-is-born-wilco.jpeg"
    },
    {
        "title": "Tracking all of President Trump’s false or misleading claims",
        "source": "https://www.washingtonpost.com/graphics/politics/trump-claims-database/",
        "key_text": "In four years, President Trump made 30,573 false or misleading claims.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "AI crap",
        "source": "https://drewdevault.com/2023/08/29/2023-08-29-AI-crap.html",
        "key_text": "There is a machine learning bubble, but the technology is here to stay. Once the bubble pops, the world will be changed by machine learning. But it will probably be crappier, not better.\n\nContrary to the AI doomer’s expectations, the world isn’t going to go down in flames any faster thanks to AI. Contemporary advances in machine learning aren’t really getting us any closer to AGI.\n\nWhat will happen to AI is boring old capitalism. Its staying power will come in the form of replacing competent, expensive humans with crappy, cheap robots.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "A hackable AI assistant using a single SQLite table and a handful of cron jobs | Hacker News",
        "source": "https://news.ycombinator.com/item?id=43681287",
        "key_text": "An email-based, artificial coworker is so obviously the right way to penetrate virtually every B2B market in existence.",
        "why_interesting": "",
        "screenshot": "jenkins.png"
    },
    {
        "title": "Hacking a Smart Home Device",
        "source": "https://jmswrnr.com/blog/hacking-a-smart-home-device",
        "key_text": "If we're going to hack this device to be controlled by custom software, we're going to need to understand its current capabilities and plan a point of attack, requiring the least amount of work to achieve our goal.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Facebook acquires Instagram | Hacker News",
        "source": "https://news.ycombinator.com/item?id=3817840",
        "key_text": "FaceBook is only worth 100b on paper. It's not worth close to that. The reason this is absolutely a bubble is because you have one paper tiger buying another paper tiger with virtual paper.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "DolphinGemma: How Google AI is helping decode dolphin communication | Hacker News",
        "source": "https://news.ycombinator.com/item?id=43680899",
        "key_text": "It does kind of bum me out to be at a point in time where instead of addressing our impact on the environment directly, we're trying to make computers that can talk to dolphins so we can tell them to stay out of the way lol.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Structured Procrastination",
        "source": "https://www.structuredprocrastination.com/",
        "key_text": "Anyone can do any amount of work, provided it isn't the work he is supposed to be doing at that moment.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "1945-2015 Rebuilding Dresden",
        "source": "https://mashable.com/feature/rebuilding-dresden",
        "key_text": "Over two days and nights in February 1945, American and British bombers dropped 2,400 tons of high explosives and 1,500 tons of incendiary bombs on the German city of Dresden.",
        "why_interesting": "Two days to bomb, decades to rebuild.",
        "screenshot": "sheep-frauenkirche-dresden-1957.jpg"
    },
    {
        "title": "1968 Has Ended",
        "source": "https://charlesschifano.substack.com/p/1968-has-ended",
        "key_text": "The ’68 shackles, so ubiquitous in politics and culture, are now gone. Although it didn’t happen because of the usual reasons. New generations didn’t rise up and rebel. Nobody was tossed off the boat. Nobody was forced to resign. What happened, instead, was more prosaic, and certainly more subtle, but I’ve noticed it a few times recently, especially since the beginning of the pandemic—it comes in casual conversations with university students or with those just entering their twenties, and it should have been predictable. For the first time, the period is simply too far away. If you’re an undergraduate now, you were probably born after another milestone, September 2001, and that makes 1968, for the most part, as distant as the French Revolution.",
        "why_interesting": "Culture is moving on rapidly these days.",
        "screenshot": "a-space-odyssey-1968.jpg"
    },
    {
        "title": "20 Years After The End Of The World",
        "source": "https://www.npr.org/2021/12/09/1062519603/radiohead-kid-a-amnesiac-throughline-thom-yorke-stanley-donwood",
        "key_text": "Around the same time, a Polish philosopher named Zygmunt Bauman published a book called Liquid Modernity. His big idea was that the anxiety and unease people in the West were feeling in the late 20th century was due to the fact that technology was developing faster than culture: We could not keep up with the lightning-fast advancements in communication, transportation and entertainment.",
        "why_interesting": "",
        "screenshot": "kid-a.jpg"
    },
    {
        "title": "Effective learning: Twenty rules of formulating knowledge",
        "source": "https://www.supermemo.com/en/blog/twenty-rules-of-formulating-knowledge",
        "key_text": "The speed of learning will depend on the way you formulate the material. The same material can be learned many times faster if well formulated! The difference in speed can be stunning!  ",
        "why_interesting": "Learning how to learn is an important skill never taught.",
        "screenshot": "why-we-stopped-making-einsteins.webp"
    },
    {
        "title": "4 Principles for Chess Improvement",
        "source": "https://zwischenzug.substack.com/p/4-principles-for-chess-improvement",
        "key_text": "There are more resources out there than ever. On the one hand, this is great: you have lots of material to work with. On the other, it’s a nightmare: there seems to be a huge mountain of stuff to get through. The good news is, you really don’t have to do most of that stuff. The bad news – well, it’s not really bad news – is you need to focus relentlessly on what actually matters.",
        "why_interesting": "Keep your chess training simple but consistent if you want results.",
        "screenshot": "lichess-horsey.png"
    },
    {
        "title": "A Coder Considers the Waning Days of the Craft",
        "source": "https://archive.ph/6VSg5",
        "key_text": "So maybe the thing to teach isn’t a skill but a spirit. I sometimes think of what I might have been doing had I been born in a different time. The coders of the agrarian days probably futzed with waterwheels and crop varietals; in the Newtonian era, they might have been obsessed with glass, and dyes, and timekeeping. I was reading an oral history of neural networks recently, and it struck me how many of the people interviewed—people born in and around the nineteen-thirties—had played with radios when they were little. Maybe the next cohort will spend their late nights in the guts of the A.I.s their parents once regarded as black boxes. I shouldn’t worry that the era of coding is winding down. Hacking is forever.",
        "why_interesting": "What you think has always been the way it is, might be a very recent development.",
        "screenshot": "lee-sedol.webp"
    },
    {
        "title": "A Guide to Russian Media in the Times of Total Censorship",
        "source": "https://www.proekt.media/en/guide-en/russian-media-after-war-en",
        "key_text": "The advertising model is practically disabled -- the largest international advertisers have left the market, while domestic advertisers have no desire to work with the outlawed media. As a result, the non-profit model has proven to be the most desirable, and demand for institutional donor grants has grown exponentially.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Achieving GM Level Strength Without Calculation",
        "source": "https://www.chess-journal.com/googleSearchless.html",
        "key_text": "It's possible to create an engine without a search that reaches grandmaster strength.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "A Personal Computer for Children of All Ages",
        "source": "https://mprove.de/visionreality/media/kay72.html",
        "key_text": "For many years it has been a tradition to attempt to cure our society's ills through technology: 'You have slums? Let's build low-cost housing!' 'You can't afford that TV? We'll build a cheaper one and you can buy it on time, even though it will break before you've finished paying for it!' 'Your kids aren't learning and education is too expensive? We'll build you a teaching machine which will guarantee your kids will pass tests!' Unfortunately, most of these 'cures' are no more than paint over rust; the sources of the initial problems still remain.",
        "why_interesting": "",
        "screenshot": "dynabooks.jpg"
    },
    {
        "title": "A Lesson on Elementary Worldly Wisdom As It Relates To Investment Management & Business",
        "source": "https://fs.blog/great-talks/a-lesson-on-worldly-wisdom",
        "key_text": "Well, the first rule is that you can’t really know anything if you just remember isolated facts and try and bang ’em back. If the facts don’t hang together on a latticework of theory, you don’t have them in a usable form.You’ve got to have models in your head. And you’ve got to array your experience—both vicarious and direct—on this latticework of models. You may have noticed students who just try to remember and pound back what is remembered. Well, they fail in school and in life. You’ve got to hang experience on a latticework of models in your head.",
        "why_interesting": "",
        "screenshot": "munger-buffett.webp"
    },
    {
        "title": "A GPT-4 Capability Forecasting Challenge",
        "source": "https://nicholas.carlini.com/writing/llm-forecast/question/Capital-of-Paris",
        "key_text": "This is a game that tests your ability to predict ('forecast') how well GPT-4 will perform at various types of questions.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "All grown up and no place to go",
        "source": "https://meduza.io/en/feature/2021/12/18/all-grown-up-and-no-place-to-go",
        "key_text": "After the end, in the 1990s, we watched from below as our parents, brothers, and sisters tried to grab their chance; most, of course, didn’t catch it, but we thought when the time comes we wouldn’t miss ours. When it came, it turned out that everything that could’ve been ours was already someone else’s.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Alarming Navy Intel Slide Warns Of China’s 200 Times Greater Shipbuilding Capacity",
        "source": "https://www.twz.com/alarming-navy-intel-slide-warns-of-chinas-200-times-greater-shipbuilding-capacity",
        "key_text": "The graphic shows that China’s shipyards have a capacity of around 23,250,000 tons versus less than 100,000 tons in the United States. That is at least an astonishing 232 times greater than the United States.",
        "why_interesting": "",
        "screenshot": "us-china-ship-building-capacity.webp"
    },
    {
        "title": "Al-Assad’s Soldiers Hope for Amnesty. First, They Have to Take a Number.",
        "source": "https://www.nytimes.com/2024/12/18/world/middleeast/syria-assad-soldier-amnesty.html",
        "key_text": "During its decades-long rule, the Assad government built a brutal security apparatus, detaining, torturing and executing opponents. Last week, the rebel coalition that overthrew him said it would hunt down senior officials implicated in crimes, while rank-and-file conscripted soldiers would receive amnesty. More than 600 people came when the so-called reconciliation center first opened on Sunday in Latakia, in a province that has been an Assad stronghold. Many more followed on Monday, the line extending the length of the large security compound.",
        "why_interesting": "Bureaucracy always pops up.",
        "screenshot": ""
    },
    {
        "title": "In Praise of Idleness",
        "source": "https://harpers.org/archive/1932/10/in-praise-of-idleness/",
        "key_text": "I think that there is far too much work done in the world, that immense harm is caused by the belief that work is virtuous, and that what needs to be preached in modern industrial countries is quite different from what always has been preached.",
        "why_interesting": "",
        "screenshot": "bertrand-russell-child.jpg"
    },
    {
        "title": "Theodore Hall Wikipedia",
        "source": "https://en.wikipedia.org/wiki/Theodore_Hall",
        "key_text": "In June 1946, Hall's security clearance was revoked by the US Army, not over suspicions of being a Soviet asset but because of discovery of a letter he had received from his British sister-in-law, his brother Edward's wife Edith, who inquired jokingly of him: \"I hear you're working on something that goes up with a big bang! Can you send us one of them for Guy Fawkes Day?\"",
        "why_interesting": "Theodore Hall got betrayed as Soviet spy by his aunt because she mentioned having heard he's working on something that goes up with a big bang.",
        "screenshot": "theodore-hall.jpg"
    },
    {
        "title": "How to Stage a Coup",
        "source": "https://www.statecraft.pub/p/how-to-commit-a-coup",
        "key_text": "For example, King Hassan II of Morocco was the victim of a coup. His airplane was to be shot down coming back from Paris, but he landed and became very energetic, took control of the airbase, and then eventually tracked down the organizer of the coup, who was the minister of the interior, General Mohamed Oufkir. According to King Hassan's New York Times obituary, \"When pilots of his air force attacked his Boeing 727 jetliner, the King, himself a pilot, seized the radio and shouted, 'Stop firing! The tyrant is dead!' — fooling the rebels into breaking off their attack.\"",
        "why_interesting": "King Hassan II called himself a tyrant to fool the rebels.",
        "screenshot": "king-hassan-2.jpg"
    },
    {
        "title": "Time For Light interview Screaming Trees",
        "source": "https://archive.ph/crQNh",
        "key_text": "One of the high points both for Martin, and the Trees in general, came when President Clinton used the drum riff from \"Nearly Lost You\" as the background during the Inauguration ceremony. \"It was really weird, these tribal drums; but I thought it was pretty cool because I came up with that part.\"",
        "why_interesting": "Bill Clinton used the drum riff from \"Nearly Lost You\" as background music during his Inauguration ceremony.",
        "screenshot": "bill-clinton-inauguration-1993.jpg"
    },
    {
        "title": "Russian Word for Queen in Chess",
        "source": "",
        "key_text": "",
        "why_interesting": "The Russian word for queen in chess is masculine.",
        "screenshot": "russian-word-queen-male.png"
    },
    {
        "title": "Soorin Kim Twitter",
        "source": "https://twitter.com/SooRinKimm/status/1749706123639214132",
        "key_text": "You actually hear the Smiths more often than you'd think at 2024 Trump rallies.",
        "why_interesting": "Trump plays The Smiths Please, Please, Please, Let Me Get What I Want at rallies.",
        "screenshot": "hatful-of-hollow.jpg"
    },
    {
        "title": "Commodus the gladiator",
        "source": "https://en.wikipedia.org/wiki/Commodus#Commodus_the_gladiator",
        "key_text": "Commodus also had a passion for gladiatorial combat, which he took so far as to take to the arena himself, dressed as a secutor. The Romans found Commodus' gladiatorial combat to be scandalous and disgraceful. According to Herodian, spectators of Commodus thought it unbecoming of an emperor to take up arms in the amphitheater for sport when he could be campaigning against barbarians among other opponents of Rome. The consensus was that it was below his office to participate as a gladiator.",
        "why_interesting": "Trump acts like Commodus.",
        "screenshot": "commodus-in-arena.jpg"
    },
    {
        "title": "Yandex founder Arkady Volozh says he hired security detail after Putin hinted at Prigozhin's demise",
        "source": "https://meduza.io/en/news/2025/01/10/yandex-founder-arkady-volozh-says-he-hired-a-security-detail-after-putin-called-him-a-talented-person-the-same-phrase-he-used-when-commenting-on-prigozhin-s-violent-death",
        "key_text": "In August 2023, the Russian president publicly described the tech entrepreneur as \"a talented person\" — the same language he'd recently used when commenting on the violent death of mercenary leader Yevgeny Prigozhin, who perished with several others in a plane crash under suspicious circumstances, two months after his brief but shocking armed insurrection.",
        "why_interesting": "When Putin calls you a talented person, you have to fear for your life.",
        "screenshot": "putin-volozh.webp"
    },
    {
        "title": "WarGonzo",
        "source": "https://meduza.io/en/feature/2025/01/10/america-has-legitimized-redrawing-the-world-map",
        "key_text": "And we'll turn a blind eye to the liberation of Canada. Except for Quebec, of course — it should return to its rightful home in France. But only after Marine Le Pen comes to power there.",
        "why_interesting": "Russian war bloggers are already thinking of returning Quebec to France after the American war between the USA and Canada.",
        "screenshot": "france-quebec.jpg"
    },
    {
        "title": "Tehanu",
        "source": "https://www.tehanu.io/",
        "key_text": "Animals, trees, and many other species are essential to the global economy. Our world cannot prosper if only humans benefit from its resources. Tehanu exists in the belief that these species need to participate in our economy in order to survive.",
        "why_interesting": "Tehanu wants to extends the gig economy to animals.",
        "screenshot": "tehanu.webp"
    },
    {
        "title": "Anthropic jobs boards",
        "source": "https://boards.greenhouse.io/anthropic/jobs/4462114008",
        "key_text": "They will build and maintain strong relationships with our Human Feedback (HF) resources and optimize how we do this work on an ongoing basis.",
        "why_interesting": "Anthropic calls people human feedback resources.",
        "screenshot": ""
    },
    {
        "title": "Максим Кац",
        "source": "https://www.youtube.com/watch?v=NyhCZvFE0C4",
        "key_text": "Apple has a market cap of over $2.5 trillion. If you consider the aggregate budget of Russia, Apple's market cap should be covering all the costs for five years.",
        "why_interesting": "Market cap Apple covers 5 years of the Russia budget.",
        "screenshot": "maxim-katz.png"
    },
    {
        "title": "62 Fascinating Facts of 2024",
        "source": "https://www.nytimes.com/2024/12/31/insider/-ifacts-2024.html",
        "key_text": "Only 15 percent of previously married women say they want to do it again, according to a Pew Center for Research study. That's half the portion of men who want to remarry.",
        "why_interesting": "Only 15 percent of previously married women say they want to do it again.",
        "screenshot": "62-fascinating-facts-2024.webp"
    },
    {
        "title": "Why we stopped making Einsteins",
        "source": "https://www.theintrinsicperspective.com/p/why-we-stopped-making-einsteins",
        "key_text": "In fact, there was a family tutor of the Einsteins who went by the name Max Talmud (possibly the best name of a tutor ever), and it was indeed Max Talmud who introduced the young 12-year-old Albert to geometry, prefacing young Albert's eventual transformation of our understanding of space and time into something geometric. Maybe we don't make Einsteins anymore because we don't make Max Talmuds anymore.",
        "why_interesting": "Einstein's tutor was called Max Talmud.",
        "screenshot": "max-talmud.jpg"
    },
    {
        "title": "Don't believe him",
        "source": "https://www.nytimes.com/video/opinion/100000009968320/dont-believe-him.html",
        "key_text": "Steve Bannon: The opposition party is the media. And the media can only, because they're dumb and they're lazy, they can only focus on one thing at a time. … All we have to do is flood the zone. Every day we hit them with three things. They'll bite on one, and we'll get all of our stuff done. Bang, bang, bang. These guys will never — will never be able to recover. But we've got to start with muzzle velocity.",
        "why_interesting": "Steve Bannon calls overwhelming the media muzzle velocity.",
        "screenshot": "muzzle-velocity.jpg"
    },
    {
        "title": "Myspace Wikipedia",
        "source": "https://en.wikipedia.org/wiki/Myspace",
        "key_text": "In June 2006, it surpassed Yahoo and Google to become the most visited website in the United States.",
        "why_interesting": "At one point in time Myspace was visited more than Google.",
        "screenshot": "memento-mori.webp"
    },
    {
        "title": "Anima archives",
        "source": "https://animafestival.be/animafestival/up/a-propos/Archives/1991/1991-compressed.pdf",
        "key_text": "",
        "why_interesting": "Anima festival used to be sponsored by Bifi.",
        "screenshot": "bifi-sponsor-anima-festival.png"
    },
    {
        "title": "Nam-ı Kemal jokes",
        "source": "https://en.m.wikipedia.org/wiki/Nam-%C4%B1_Kemal_jokes",
        "key_text": "Nam-ı Kemal jokes (Turkish: Nâm-ı Kemâl fıkraları) are a variety of dirty jokes in Turkish folk literature that originated during the Ottoman era. In the archaic Ottoman Turkish language, the phrase nam-ı Kemal means \" a man named Kemal\", i.e. a generic and unconventionally humorous everyman. However, due to the phrase's vocal similarity with the name of one of the most foremost figures in Turkish literature, the poet and playwright Namık Kemal (1840–1888), the jokes underwent an evolution. With the growing obscurity of Ottoman terms among most speakers of modern Turkish, \"nam-ı Kemal jokes\" became, more often than not, \"Namık Kemal jokes\", an example of a mondegreen. The obscenity of the \"nam-ı Kemal jokes\" tradition is based mainly on phallic exaggerations.",
        "why_interesting": "Nam-ı Kemal jokes are dirty jokes in Turkish.",
        "screenshot": "namik-kemal.jpg"
    },
    {
        "title": "The Russian Effort to Abolish Marriage",
        "source": "https://www.theatlantic.com/magazine/archive/1926/07/the-russian-effort-to-abolish-marriage/306295/",
        "key_text": " As a solution for the vexing problem of children she suggested a scheme of 'marriage insurance,' to be financed by an annual levy of one dollar on every adult citizen of the Soviet Union. This would provide a fund of about sixty million dollars a year, enough to provide for all the babies who might be born as a result of free-love unions.",
        "why_interesting": "",
        "screenshot": "kollontai.jpg"
    },
    {
        "title": "fellrnr",
        "source": "https://fellrnr.com/wiki/Trust_No_One",
        "key_text": "The most important running tip I have is this; do not trust these running tips! More precisely, don't take anything I, or anyone else, tells you at face value. Do your own research, check the references given, and verify the facts that are presented.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "AI legibility, physical archives, and the future of research",
        "source": "https://resobscura.substack.com/p/ai-legibility-archives-future-of-research",
        "key_text": "Generative AI has made it absurdly easy to generate a lot of text or images. But it hasn't made us any better at subtracting the useful, meaningful, or simply interesting stuff from text and images — isolating the gold from the fool's gold.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Unmasking EncryptHub: Help from ChatGPT & OPSEC blunders",
        "source": "",
        "key_text": "This brings us to the present, and to the picture of a conflicted man. Someone who has perhaps not had the easiest life, and has struggled to choose between a legitimate career and cybercrime and trying to play both roles at the same time. Whatever his motivations, he is clearly a driven individual with a desire to learn.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "Trump tells Oprah his political views in 1988",
        "source": "https://youtu.be/6BJYbn4MppM?feature=shared&t=21",
        "key_text": "I want free trade.",
        "why_interesting": "",
        "screenshot": ""
    },
    {
        "title": "How couples met (1930-2024)",
        "source": "https://x.com/burkov/status/1843793993274143184",
        "key_text": "",
        "why_interesting": "",
        "screenshot": "how-couples-met-2024.png"
    },
    {
        "title": "Northern European Enclosure Dam",
        "source": "https://en.wikipedia.org/wiki/Northern_European_Enclosure_Dam",
        "key_text": "The Northern European Enclosure Dam (NEED) is a proposed solution to the problem of rising ocean levels in Northern Europe. It would be a megaproject, involving the construction of two massive dams in the English Channel and the North Sea; the former between France and England, and the latter between Scotland and Norway.",
        "why_interesting": "",
        "screenshot": "need.png"
    },
    {
        "title": "The case against conversational interfaces",
        "source": "https://julian.digital/2025/03/27/the-case-against-conversational-interfaces/",
        "key_text": "To put the writing and speaking speeds into perspective, we form thoughts at 1,000-3,000 words per minute. Natural language might be natural, but it’s a bottleneck. And yet, if you think about your day-to-day interactions with other humans, most communication feels really fast and efficient. That’s because natural language is only one of many data transfer mechanisms available to us. For example, instead of saying “I think what you just said is a great idea”, I can just give you a thumbs up. Or nod my head. Or simply smile. ",
        "why_interesting": "",
        "screenshot": "thumb-data-compression.png"
    }
]