[
    {
        "name": "Datasette llm",
        "url": "https://llm.datasette.io/en/stable/",
        "description": "A Datasette CLI utility and Python library for interacting with Large Language Models"
    },
    {
        "name": "Datasette",
        "url": "https://datasette.io/",
        "description": "Datasette is a tool for exploring and publishing data. It helps people take data of any shape, analyze and explore it, and publish it as an interactive website and accompanying API."
    },
    {
        "name": "Claude",
        "url": "https://www.anthropic.com/claude",
        "description": "Claude is a family of large language models developed by Anthropic."
    },
    {
        "name": "jq",
        "url": "https://jqlang.org/",
        "description": "jq is a command-line JSON processor. You can transform structured data with the same ease that sed, awk, grep and friends let you play with text."
    },
    {
        "name": "Document Web API",
        "url": "https://developer.mozilla.org/en-US/docs/Web/API/Document",
        "description": "The Document interface represents any web page loaded in the browser and serves as an entry point into the web page's content, which is the DOM tree."
    },
    {
        "name": "Python",
        "url": "https://www.python.org/",
        "description": "Python is a programming language that lets you work quickly and integrate systems more effectively."
    },
    {
        "name": "Firefox DevTools",
        "url": "https://firefox-source-docs.mozilla.org/devtools-user/",
        "description": "Firefox Developer Tools is a set of web developer tools built into Firefox. You can use them to examine, edit, and debug HTML, CSS, and JavaScript."
    },
    {
        "name": "curl",
        "url": "https://curl.se/",
        "description": "curl is used in command lines or scripts to transfer data."
    },
    {
        "name": "GitHub Actions",
        "url": "https://github.com/features/actions",
        "description": "GitHub Actions makes it easy to automate all your software workflows, right from GitHub. "
    },
    {
        "name": "sqlite-utils",
        "url": "https://sqlite-utils.datasette.io/en/stable/",
        "description": "Library and command-line utility to help create SQLite databases from an existing collection of data."
    }
]