[
    {
        "name": "1945-2015 Rebuilding Dresden",
        "source": "https://mashable.com/feature/rebuilding-dresden",
        "key_text": "",
        "why_interesting": "It tooks 2 days to bomb Dresden, it took decades before the city was rebuilt."
    },
    {
        "name": "1968 Has Ended",
        "source": "https://charlesschifano.substack.com/p/1968-has-ended",
        "key_text": "The ’68 shackles, so ubiquitous in politics and culture, are now gone. Although it didn’t happen because of the usual reasons. New generations didn’t rise up and rebel. Nobody was tossed off the boat. Nobody was forced to resign. What happened, instead, was more prosaic, and certainly more subtle, but I’ve noticed it a few times recently, especially since the beginning of the pandemic—it comes in casual conversations with university students or with those just entering their twenties, and it should have been predictable. For the first time, the period is simply too far away. If you’re an undergraduate now, you were probably born after another milestone, September 2001, and that makes 1968, for the most part, as distant as the French Revolution.",
        "why_interesting": "Culture is moving on rapidly these days."
    }, 
    {
        "name": "20 Years After The End Of The World",
        "source": "https://www.npr.org/2021/12/09/1062519603/radiohead-kid-a-amnesiac-throughline-thom-yorke-stanley-donwood",
        "key_text": "Around the same time, a Polish philosopher named Zygmunt Bauman published a book called Liquid Modernity. His big idea was that the anxiety and unease people in the West were feeling in the late 20th century was due to the fact that technology was developing faster than culture: We could not keep up with the lightning-fast advancements in communication, transportation and entertainment.",
        "why_interesting": "Radiohead was always about dread."
    },
    {
        "name": "Effective learning: Twenty rules of formulating knowledge",
        "source": "https://www.supermemo.com/en/blog/twenty-rules-of-formulating-knowledge",
        "key_text": "The speed of learning will depend on the way you formulate the material. The same material can be learned many times faster if well formulated! The difference in speed can be stunning!  ",
        "why_interesting": "Learning how to learn is an important skill never taught."
    },
    {
        "name": "4 Principles for Chess Improvement",
        "source": "https://zwischenzug.substack.com/p/4-principles-for-chess-improvement",
        "key_text": "There are more resources out there than ever. On the one hand, this is great: you have lots of material to work with. On the other, it’s a nightmare: there seems to be a huge mountain of stuff to get through. The good news is, you really don’t have to do most of that stuff. The bad news – well, it’s not really bad news – is you need to focus relentlessly on what actually matters.",
        "why_interesting": "Keep your chess training simple but consistent if you want results."
    }
]